module.exports.config = {
  name: "love2",
  version: "1.0.0",
  hasPermssion: 0,
  credits: "Réynél Eśquível",
  description: "Random love quotes for a person you mentioned or leave it none",
  commandCategory: "quotes",
  usages: "[mention or ɴᴏɴᴇ]",
  cooldowns: 1
};

module.exports.run = async ({ api, event}) => {
 const { threadID, messageID, senderID } = event;
  
  const leiamnash1 = [
    "ʙᴏᴛʜ ᴘᴇᴏᴘʟᴇ ɴᴇᴇᴅ ᴛᴏ ᴄᴀʀᴇ ᴅᴇᴇᴘʟʏ ᴀʙᴏᴜᴛ ᴛʜᴇ ᴏᴛʜᴇʀ ᴘᴇʀsᴏɴ, ᴛᴏ ᴘᴜᴛ ᴛʜᴇ ᴏᴛʜᴇʀ’s ɴᴇᴇᴅs ʙᴇғᴏʀᴇ ᴛʜᴇɪʀ ᴏᴡɴ, ᴀɴᴅ ᴛᴏ ᴍᴀᴋᴇ ᴀ ᴅᴀɪʟʏ ᴄᴏᴍᴍɪᴛᴍᴇɴᴛ ᴛᴏ ᴛʜᴀᴛ ᴘᴇʀsᴏɴ ᴛᴏ sᴛɪᴄᴋ ɪᴛ ᴏᴜᴛ",
    "ᴛʜᴇ ᴍᴏʀᴇ ʏᴏᴜ ʟᴏᴠᴇ ᴇᴀᴄʜ ᴏᴛʜᴇʀ, ᴛʜᴇ ᴍᴏʀᴇ ʏᴏᴜ ᴄᴀɴ ʙᴇ ғʀᴇᴇ",
    "ɪғ ʏᴏᴜ ᴡᴀɴᴛ ᴛᴏ ʜᴀᴠᴇ ᴛʜᴇ ᴋɪɴᴅ ᴏғ ʟᴏᴠᴇ ᴛʜᴀᴛ ᴡɪʟʟ ᴍᴀᴋᴇ ʏᴏᴜ ʜᴀᴘᴘʏ, ʏᴏᴜ ɴᴇᴇᴅ ᴛᴏ ᴄʀᴇᴀᴛᴇ ᴛʜᴇ ᴋɪɴᴅ ᴏғ ʟᴏᴠᴇ ᴛʜᴀᴛ ɪs ʀɪɢʜᴛ ғᴏʀ ʏᴏᴜ ᴀɴᴅ ʏᴏᴜʀ ᴘᴀʀᴛɴᴇʀ. ɪᴛ's ᴀ ᴍᴀᴛᴛᴇʀ ᴏғ ᴍᴀᴋɪɴɢ ɪᴛ",
    "ғɪɴᴅ sᴏᴍᴇᴏɴᴇ ᴡʜᴏ ᴄᴏᴍғᴏʀᴛs ʏᴏᴜ ᴀᴛ ʏᴏᴜʀ ᴡᴏʀsᴛ ᴀɴᴅ ʀᴇʟɪsʜᴇs ʏᴏᴜ ᴀᴛ ʏᴏᴜʀ ʙᴇsᴛ",
    "ʟᴏᴠᴇ ᴀɴᴅ ʙᴇ ʟᴏᴠᴇᴅ ɪɴ ʀᴇᴛᴜʀɴ, ʙᴜᴛ ᴅᴏɴ’ᴛ ᴍᴀᴋᴇ ʏᴏᴜʀ ʟᴏᴠᴇ ᴄᴏɴᴅɪᴛɪᴏɴᴀʟ ᴏɴ ʙᴇɪɴɢ ʟᴏᴠᴇᴅ ʙᴀᴄᴋ",
    "ʏᴏᴜ ɴᴇᴇᴅ ᴛᴏ ʟᴇᴀʀɴ ᴛᴏ ʙᴇ ᴛʀᴜᴇ ᴛᴏ ʏᴏᴜʀsᴇʟғ. ʏᴏᴜ ᴅᴇsᴇʀᴠᴇ ɢʀᴇᴀᴛ ᴛʜɪɴɢs, ʙᴜᴛ ᴅᴏ ʏᴏᴜ ᴋɴᴏᴡ ᴛʜᴀᴛ? ᴅᴏ ʏᴏᴜ ʙᴇʟɪᴇᴠᴇ ᴛʜᴀᴛ?",
    "ᴀʟʟ ᴛʜᴇ ʟᴏᴠᴇ ʏᴏᴜ ᴡᴀɴᴛ ᴀɴᴅ ᴍᴜᴄʜ ᴍᴏʀᴇ ᴄᴀɴ ʙᴇ ʏᴏᴜʀs! ᴅᴏɴ'ᴛ ǫᴜɪᴛ ʙᴇғᴏʀᴇ ᴛʜᴇ ᴍɪʀᴀᴄʟᴇ",
    "ᴡʜᴇɴ ʏᴏᴜ sᴛᴏᴘ ᴇxᴘᴇᴄᴛɪɴɢ ᴘᴇᴏᴘʟᴇ ᴛᴏ ʙᴇ ᴘᴇʀғᴇᴄᴛ, ʏᴏᴜ ᴄᴀɴ ʟɪᴋᴇ ᴛʜᴇᴍ ғᴏʀ ᴡʜᴏ ᴛʜᴇʏ ᴀʀᴇ",
    "ᴛʜᴇ ᴍᴇᴇᴛɪɴɢ ᴏғ ᴛᴡᴏ ᴘᴇʀsᴏɴᴀʟɪᴛɪᴇs ɪs ʟɪᴋᴇ ᴛʜᴇ ᴄᴏɴᴛᴀᴄᴛ ᴏғ ᴛᴡᴏ ᴄʜᴇᴍɪᴄᴀʟ sᴜʙsᴛᴀɴᴄᴇs: ɪғ ᴛʜᴇʀᴇ ɪs ᴀɴʏ ʀᴇᴀᴄᴛɪᴏɴ, ʙᴏᴛʜ ᴀʀᴇ ᴛʀᴀɴsғᴏʀᴍᴇᴅ",
    "ʏᴏᴜʀ ᴛᴀsᴋ ɪs ɴᴏᴛ ᴛᴏ sᴇᴇᴋ ʟᴏᴠᴇ, ʙᴜᴛ ᴍᴇʀᴇʟʏ ᴛᴏ sᴇᴇᴋ ᴀɴᴅ ғɪɴᴅ ᴀʟʟ ᴛʜᴇ ʙᴀʀʀɪᴇʀs ᴡɪᴛʜɪɴ ʏᴏᴜʀsᴇʟғ ᴛʜᴀᴛ ʏᴏᴜ ʜᴀᴠᴇ ʙᴜɪʟᴛ ᴀɢᴀɪɴsᴛ ɪᴛ",
    "ᴛʜᴇ ʙᴇɢɪɴɴɪɴɢ ᴏғ ʟᴏᴠᴇ ɪs ᴛᴏ ʟᴇᴛ ᴛʜᴏsᴇ ᴡᴇ ʟᴏᴠᴇ ʙᴇ ᴘᴇʀғᴇᴄᴛʟʏ ᴛʜᴇᴍsᴇʟᴠᴇs, ᴀɴᴅ ɴᴏᴛ ᴛᴏ ᴛᴡɪsᴛ ᴛʜᴇᴍ ᴛᴏ ғɪᴛ ᴏᴜʀ ᴏᴡɴ ɪᴍᴀɢᴇ. ᴏᴛʜᴇʀᴡɪsᴇ, ᴡᴇ ʟᴏᴠᴇ ᴏɴʟʏ ᴛʜᴇ ʀᴇғʟᴇᴄᴛɪᴏɴ ᴏғ ᴏᴜʀsᴇʟᴠᴇs ᴡᴇ ғɪɴᴅ ɪᴛ ᴛʜᴇᴍ",
    "ᴛʜᴇʀᴇ ᴀʀᴇ ᴛᴡᴏ ᴋɪɴᴅs ᴏғ sᴘᴀʀᴋs, ᴛʜᴇ ᴏɴᴇ ᴛʜᴀᴛ ɢᴏᴇs ᴏғғ ᴡɪᴛʜ ᴀ ʜɪᴛᴄʜ ʟɪᴋᴇ ᴀ ᴍᴀᴛᴄʜ, ʙᴜᴛ ɪᴛ ʙᴜʀɴs ǫᴜɪᴄᴋʟʏ. ᴛʜᴇ ᴏᴛʜᴇʀ ɪs ᴛʜᴇ ᴋɪɴᴅ ᴛʜᴀᴛ ɴᴇᴇᴅs ᴛɪᴍᴇ, ʙᴜᴛ ᴡʜᴇɴ ᴛʜᴇ ғʟᴀᴍᴇ sᴛʀɪᴋᴇs… ɪᴛ's ᴇᴛᴇʀɴᴀʟ, ᴅᴏɴ'ᴛ ғᴏʀɢᴇᴛ ᴛʜᴀᴛ",
    "ᴏɴᴇ ᴅᴀʏ, sᴏᴍᴇᴏɴᴇ ᴡɪʟʟ ᴡᴀʟᴋ ɪɴᴛᴏ ʏᴏᴜʀ ʟɪғᴇ ᴀɴᴅ ᴍᴀᴋᴇ ʏᴏᴜ sᴇᴇ ᴡʜʏ ɪᴛ ɴᴇᴠᴇʀ ᴡᴏʀᴋᴇᴅ ᴏᴜᴛ ᴡɪᴛʜ ᴀɴʏᴏɴᴇ ᴇʟsᴇ",
    "ᴡʜᴇɴ ɪᴛ’s ᴛɪᴍᴇ ғᴏʀ sᴏᴜʟs ᴛᴏ ᴍᴇᴇᴛ, ᴛʜᴇʀᴇ’s ɴᴏᴛʜɪɴɢ ᴏɴ ᴇᴀʀᴛʜ ᴛʜᴀᴛ ᴄᴀɴ ᴘʀᴇᴠᴇɴᴛ ᴛʜᴇᴍ ғʀᴏᴍ ᴍᴇᴇᴛɪɴɢ, ɴᴏ ᴍᴀᴛᴛᴇʀ ᴡʜᴇʀᴇ ᴇᴀᴄʜ ᴍᴀʏ ʙᴇ ʟᴏᴄᴀᴛᴇᴅ. ᴡʜᴇɴ ᴛᴡᴏ ʜᴇᴀʀᴛs ᴀʀᴇ ᴍᴇᴀɴᴛ ғᴏʀ ᴇᴀᴄʜ ᴏᴛʜᴇʀ, ɴᴏ ᴅɪsᴛᴀɴᴄᴇ ɪs ᴛᴏᴏ ғᴀʀ, ɴᴏ ᴛɪᴍᴇ ɪs ᴛᴏᴏ ʟᴏɴɢ, ᴀɴᴅ ɴᴏ ᴏᴛʜᴇʀ ʟᴏᴠᴇ ᴄᴀɴ ʙʀᴇᴀᴋ ᴛʜᴇᴍ ᴀᴘᴀʀᴛ",
    "ᴀ ғʀɪᴇɴᴅ ɪs sᴏᴍᴇᴏɴᴇ ᴡʜᴏ ᴋɴᴏᴡs ᴛʜᴇ sᴏɴɢ ɪɴ ʏᴏᴜʀ ʜᴇᴀʀᴛ ᴀɴᴅ ᴄᴀɴ sɪɴɢ ɪᴛ ʙᴀᴄᴋ ᴛᴏ ʏᴏᴜ ᴡʜᴇɴ ʏᴏᴜ ʜᴀᴠᴇ ғᴏʀɢᴏᴛᴛᴇɴ ᴛʜᴇ ᴡᴏʀᴅs",
    "ғʀɪᴇɴᴅs ᴄᴀɴ ʜᴇʟᴘ ᴇᴀᴄʜ ᴏᴛʜᴇʀ. ᴀ ᴛʀᴜᴇ ғʀɪᴇɴᴅ ɪs sᴏᴍᴇᴏɴᴇ ᴡʜᴏ ʟᴇᴛs ʏᴏᴜ ʜᴀᴠᴇ ᴛᴏᴛᴀʟ ғʀᴇᴇᴅᴏᴍ ᴛᴏ ʙᴇ ʏᴏᴜʀsᴇʟғ ᴀɴᴅ ᴇsᴘᴇᴄɪᴀʟʟʏ ᴛᴏ ғᴇᴇʟ. ᴏʀ, ɴᴏᴛ ғᴇᴇʟ. ᴡʜᴀᴛᴇᴠᴇʀ ʏᴏᴜ ʜᴀᴘᴘᴇɴ ᴛᴏ ʙᴇ ғᴇᴇʟɪɴɢ ᴀᴛ ᴛʜᴇ ᴍᴏᴍᴇɴᴛ ɪs ғɪɴᴇ ᴡɪᴛʜ ᴛʜᴇᴍ. ᴛʜᴀᴛ's ᴡʜᴀᴛ ʀᴇᴀʟ ʟᴏᴠᴇ ᴀᴍᴏᴜɴᴛs ᴛᴏ – ʟᴇᴛᴛɪɴɢ ᴀ ᴘᴇʀsᴏɴ ʙᴇ ᴡʜᴀᴛ ᴛʜᴇʏ ʀᴇᴀʟʟʏ ᴀʀᴇ",
    "ᴛʀᴜᴇ ғʀɪᴇɴᴅsʜɪᴘ ᴄᴏᴍᴇs ᴡʜᴇɴ ᴛʜᴇ sɪʟᴇɴᴄᴇ ʙᴇᴛᴡᴇᴇɴ ᴛᴡᴏ ᴘᴇᴏᴘʟᴇ ɪs ᴄᴏᴍғᴏʀᴛᴀʙʟᴇ",
    "ᴋᴇᴇᴘ ᴛʜᴇ ᴘᴀsᴛ ɪɴ ᴛʜᴇ ᴘᴀsᴛ",
    "ʟᴏᴏᴋ ᴀᴛ ᴀᴄᴛɪᴏɴs ᴍᴏʀᴇ ᴛʜᴀɴ ᴡᴏʀᴅs",
    "ʟᴏᴠᴇ ɪs ᴛʜᴇ ᴛʀɪᴜᴍᴘʜ ᴏғ ɪᴍᴀɢɪɴᴀᴛɪᴏɴ ᴏᴠᴇʀ ɪɴᴛᴇʟʟɪɢᴇɴᴄᴇ",
    "ᴛʜɪs ʙᴇᴛᴛᴇʀ ᴛᴏ ʜᴀᴠᴇ ʟᴏᴠᴇᴅ ᴀɴᴅ ʟᴏsᴛ ᴛʜᴀɴ ɴᴇᴠᴇʀ ᴛᴏ ʜᴀᴠᴇ ʟᴏᴠᴇᴅ ᴀᴛ ᴀʟʟ",
    "ʏᴇᴛ ɪᴛ ɪs ᴏɴʟʏ ʟᴏᴠᴇ ᴡʜɪᴄʜ sᴇᴛs ᴜs ғʀᴇᴇ",
    "ᴛʜᴇʀᴇ ɪs ᴏɴʟʏ ᴏɴᴇ ʜᴀᴘᴘɪɴᴇss ɪɴ ʟɪғᴇ, ᴛᴏ ʟᴏᴠᴇ ᴀɴᴅ ᴛᴏ ʙᴇ ʟᴏᴠᴇᴅ",
    "ʟᴏᴠᴇ ɪs ʟɪᴋᴇ ᴛʜᴇ ᴡɪɴᴅ, ʏᴏᴜ ᴄᴀɴ’ᴛ sᴇᴇ ɪᴛ ʙᴜᴛ ʏᴏᴜ ᴄᴀɴ ғᴇᴇʟ ɪᴛ",
    "ʟᴏᴠᴇ ɪs ᴄᴏᴍᴘᴏsᴇᴅ ᴏғ ᴀ sɪɴɢʟᴇ sᴏᴜʟ ɪɴʜᴀʙɪᴛɪɴɢ ᴛᴡᴏ ʙᴏᴅɪᴇs",
    "ʟᴏᴠᴇ ɪs ᴛʜᴇ ᴘᴏᴇᴛʀʏ ᴏғ ᴛʜᴇ sᴇɴsᴇs",
    "ᴡᴇ ᴀʀᴇ ᴍᴏsᴛ ᴀʟɪᴠᴇ ᴡʜᴇɴ ᴡᴇ’ʀᴇ ɪɴ ʟᴏᴠᴇ",
    "ʟᴏᴠᴇ ɪs ғʀɪᴇɴᴅsʜɪᴘ ᴛʜᴀᴛ ʜᴀs ᴄᴀᴜɢʜᴛ ғɪʀᴇ",
    "ʟᴏᴠᴇ ɪs ᴀɴ ᴇɴᴅʟᴇss ᴀᴄᴛ ᴏғ ғᴏʀɢɪᴠᴇɴᴇss",
    "ɪғ ɪ ᴋɴᴏᴡ ᴡʜᴀᴛ ʟᴏᴠᴇ ɪs, ɪᴛ ɪs ʙᴇᴄᴀᴜsᴇ ᴏғ ʏᴏᴜ",
  ];
   const leiamnash2 = [
    "ʟᴏᴠᴇ ᴛʜᴇ ʟɪғᴇ ʏᴏᴜ ʟɪᴠᴇ. ʟɪᴠᴇ ᴛʜᴇ ʟɪғᴇ ʏᴏᴜ ʟᴏᴠᴇ",
    "ᴡᴇ ʟᴏᴠᴇ ᴛʜᴇ ᴛʜɪɴɢs ᴡᴇ ʟᴏᴠᴇ ғᴏʀ ᴡʜᴀᴛ ᴛʜᴇʏ ᴀʀᴇ",
    "ɴᴇᴠᴇʀ sᴇᴛ ʟɪᴍɪᴛs ᴡʜᴇɴ ʏᴏᴜ ᴀʀᴇ ʟᴏᴠɪɴɢ sᴏᴍᴇᴏɴᴇ",
    "ʟᴏᴠᴇ ᴅᴏᴇs ɴᴏᴛ ᴅᴏᴍɪɴᴀᴛᴇ; ɪᴛ ᴄᴜʟᴛɪᴠᴀᴛᴇs",
    "ʟᴏᴠᴇ ɪs ᴛʜᴇ ᴡʜᴏʟᴇ ᴛʜɪɴɢ. ᴡᴇ ᴀʀᴇ ᴏɴʟʏ ᴘɪᴇᴄᴇs",
    "ᴛᴏ ʟᴏᴠᴇ ᴀɴᴅ ʙᴇ ʟᴏᴠᴇᴅ ɪs ᴛᴏ ғᴇᴇʟ ᴛʜᴇ sᴜɴ ғʀᴏᴍ ʙᴏᴛʜ sɪᴅᴇs",
    "ʟɪғᴇ ɪs ᴛʜᴇ ғʟᴏᴡᴇʀ ғᴏʀ ᴡʜɪᴄʜ ʟᴏᴠᴇ ɪs ᴛʜᴇ ʜᴏɴᴇʏ",
    "ʏᴏᴜ ᴀʟᴡᴀʏs ɢᴀɪɴ ʙʏ ɢɪᴠɪɴɢ ʟᴏᴠᴇ",
    "ᴛʜᴇ sᴍɪʟᴇ ɪs ᴛʜᴇ ʙᴇɢɪɴɴɪɴɢ ᴏғ ʟᴏᴠᴇ",
    "ᴀᴛ ᴛʜᴇ ᴛᴏᴜᴄʜ ᴏғ ʟᴏᴠᴇ ᴇᴠᴇʀʏᴏɴᴇ ʙᴇᴄᴏᴍᴇs ᴀ ᴘᴏᴇᴛ",
    "ᴛʜᴇ ɢɪᴠɪɴɢ ᴏғ ʟᴏᴠᴇ ɪs ᴀɴ ᴇᴅᴜᴄᴀᴛɪᴏɴ ɪɴ ɪᴛsᴇʟғ",
    "ᴀʙsᴇɴᴄᴇ sʜᴀʀᴘᴇɴs ʟᴏᴠᴇ, ᴘʀᴇsᴇɴᴄᴇ sᴛʀᴇɴɢᴛʜᴇɴs ɪᴛ",
    "ʟᴏᴠᴇ ɪs ᴡʜᴀᴛ ʏᴏᴜ’ᴠᴇ ʙᴇᴇɴ ᴛʜʀᴏᴜɢʜ ᴡɪᴛʜ sᴏᴍᴇʙᴏᴅʏ",
    "ʟᴏᴠᴇ ɪs ᴀ ᴛʜɪɴɢ ᴛʜᴀᴛ ɪs ғᴜʟʟ ᴏғ ᴄᴀʀᴇs ᴀɴᴅ ғᴇᴀʀs",
    "ʏᴏᴜ ᴄᴀʟʟ ɪᴛ ᴍᴀᴅɴᴇss, ʙᴜᴛ ɪ ᴄᴀʟʟ ɪᴛ ʟᴏᴠᴇ",
    "ʟᴏᴠᴇ ɪs ɴᴏᴛ ʟᴏᴠᴇ ᴜɴᴛɪʟ ʟᴏᴠᴇ’s ᴠᴜʟɴᴇʀᴀʙʟᴇ",
    "ᴡʜᴇɴ ᴡᴇ ʟᴏᴠᴇ, ᴡᴇ ᴀʟᴡᴀʏs sᴛʀɪᴠᴇ ᴛᴏ ʙᴇᴄᴏᴍᴇ ʙᴇᴛᴛᴇʀ ᴛʜᴀɴ ᴡᴇ ᴀʀᴇ",
    "ʟᴏᴠᴇ ᴀʟʟ, ᴛʀᴜsᴛ ᴀ ғᴇᴡ, ᴅᴏ ᴡʀᴏɴɢ ᴛᴏ ɴᴏɴᴇ",
    "ʟᴏᴠᴇ ɪs ᴛʜᴇ ᴜʟᴛɪᴍᴀᴛᴇ ᴇxᴘʀᴇssɪᴏɴ ᴏғ ᴛʜᴇ ᴡɪʟʟ ᴛᴏ ʟɪᴠᴇ",
    "ᴛᴇʟʟ ᴍᴇ ᴡʜᴏᴍ ʏᴏᴜ ʟᴏᴠᴇ ᴀɴᴅ ɪ ᴡɪʟʟ ᴛᴇʟʟ ʏᴏᴜ ᴡʜᴏ ʏᴏᴜ ᴀʀᴇ",
    "ʟᴏᴠᴇ ɪs ᴡʜᴀᴛ ᴍᴀᴋᴇs ᴛʜᴇ ʀɪᴅᴇ ᴡᴏʀᴛʜᴡʜɪʟᴇ",
    "ʟᴏᴠᴇ ɪs ɴᴏᴛ ᴀ ᴠᴏʟᴜɴᴛᴇᴇʀ ᴛʜɪɴɢ",
    "ʟᴏᴠᴇ ɪs sʜᴏᴡɴ ᴍᴏʀᴇ ɪɴ ᴅᴇᴇᴅs ᴛʜᴀɴ ɪɴ ᴡᴏʀᴅs",
    "ʟᴏᴠᴇ ʙʀɪɴɢs ᴛᴏ ʟɪғᴇ ᴡʜᴀᴛᴇᴠᴇʀ ɪs ᴅᴇᴀᴅ ᴀʀᴏᴜɴᴅ ᴜs",
    "ʟᴏᴠᴇ ɪs ɴᴏᴛ ᴀғғᴇᴄᴛɪᴏɴᴀᴛᴇ ғᴇᴇʟɪɴɢ, ʙᴜᴛ ᴀ sᴛᴇᴀᴅʏ ᴡɪsʜ ғᴏʀ ᴛʜᴇ ʟᴏᴠᴇᴅ ᴘᴇʀsᴏɴ’s ᴜʟᴛɪᴍᴀᴛᴇ ɢᴏᴏᴅ ᴀs ғᴀʀ ᴀs ɪᴛ ᴄᴀɴ ʙᴇ ᴏʙᴛᴀɪɴᴇᴅ",    
    "ʟᴏᴠᴇ ɪs ᴡʜᴇɴ ᴛʜᴇ ᴏᴛʜᴇʀ ᴘᴇʀsᴏɴ’s ʜᴀᴘᴘɪɴᴇss ɪs ᴍᴏʀᴇ ɪᴍᴘᴏʀᴛᴀɴᴛ ᴛʜᴀɴ ʏᴏᴜʀ ᴏᴡɴ",
    "ɪᴛ’s ᴇᴀsʏ ᴛᴏ ғᴀʟʟ ɪɴ ʟᴏᴠᴇ. ᴛʜᴇ ʜᴀʀᴅ ᴘᴀʀᴛ ɪs ғɪɴᴅɪɴɢ sᴏᴍᴇᴏɴᴇ ᴛᴏ ᴄᴀᴛᴄʜ ʏᴏᴜ",
    "ʟᴏᴠᴇ ʀᴇᴄᴏɢɴɪᴢᴇs ɴᴏ ʙᴀʀʀɪᴇʀs. ɪᴛ ᴊᴜᴍᴘs ʜᴜʀᴅʟᴇs, ʟᴇᴀᴘs ғᴇɴᴄᴇs, ᴘᴇɴᴇᴛʀᴀᴛᴇs ᴡᴀʟʟs ᴛᴏ ᴀʀʀɪᴠᴇ ᴀᴛ ɪᴛs ᴅᴇsᴛɪɴᴀᴛɪᴏɴ ғᴜʟʟ ᴏғ ʜᴏᴘᴇ",
    "ʟᴏᴠᴇ ᴍᴇᴀɴs ɴᴇᴠᴇʀ ʜᴀᴠɪɴɢ ᴛᴏ sᴀʏ ʏᴏᴜ’ʀᴇ sᴏʀʀʏ",
   "ᴀɴɢ ᴛᴜɴᴀʏ ɴᴀ ᴘᴀɢ ᴍᴀᴍᴀʜᴀʟ ᴋᴀʏ ғʀᴀɴᴄɪs ʀᴀᴠᴀʟ ᴍᴏ ʟᴀɴɢ ᴍᴀᴛɪᴛɪᴋᴍᴀɴ",
    "ᴛʜᴇ ɢʀᴇᴀᴛᴇʀ ʏᴏᴜʀ ᴄᴀᴘᴀᴄɪᴛʏ ᴛᴏ ʟᴏᴠᴇ, ᴛʜᴇ ɢʀᴇᴀᴛᴇʀ ʏᴏᴜʀ ᴄᴀᴘᴀᴄɪᴛʏ ᴛᴏ ғᴇᴇʟ ᴛʜᴇ ᴘᴀɪɴ",
      "ᴀɴɢ ᴛᴜɴᴀʏ ɴᴀ ᴘᴀɢ ᴍᴀᴍᴀʜᴀʟ ᴋᴀʏ ғʀᴀɴᴄɪs ʀᴀᴠᴀʟ ᴍᴏ ʟᴀɴɢ ᴍᴀᴛɪᴛɪᴋᴍᴀɴ",
   ];
var mention = Object.keys(event.mentions);

 var leiamnash3 = ['1', '2'];
 var leiamnash = leiamnash3[Math.floor(Math.random() * leiamnash3.length)];

if (Object.keys(event.mentions).length == 1) {
  if (leiamnash == 2 ) {
      api.sendMessage(`🌟 | 𝖲𝖾𝗇𝗌𝖾𝗂 𝗌𝖾𝗇𝖽 𝖺 𝗆𝖾𝗌𝗌𝖺𝗀𝖾 𝗍𝗈 ${event.mentions[mention].replace("@", "")}:\n${leiamnash2[Math.floor(Math.random() * leiamnash2.length)]}`,threadID, messageID);
  }
  if (leiamnash == 1 ) {
      api.sendMessage(`💌 | 𝖲𝖾𝗇𝗌𝖾𝗂 𝗌𝖾𝗇𝖽 𝖺 𝗆𝖾𝗌𝗌𝖺𝗀𝖾 𝗍𝗈 ${event.mentions[mention].replace("@", "")}:\n${leiamnash1[Math.floor(Math.random() * leiamnash1.length)]}`, threadID, messageID);
  }
}
else {
  if (leiamnash == 2) {
   api.sendMessage(`${leiamnash2[Math.floor(Math.random() * leiamnash2.length)]}`,threadID, messageID); 
  }
  if (leiamnash == 1 ) {
   api.sendMessage(`${leiamnash1[Math.floor(Math.random() * leiamnash1.length)]}`, threadID, messageID);
  }
}

    }